""" Магические методы. Методы __str__ и __repr__,
оба этих метода отвечают за текстовое отображение в системе"""


class Lion:
    def __init__(self, name):
        self.name = name

    def __repr__(self):  # за то как наш объект будет отображаться внутри нашей системы, как будут видеть разработчики
        return f'объект Lion - {self.name}'

    def __str__(self):  # за то как будут отображен если применить методы str или print, как увидят пользователи
        return f'просто Lion - {self.name}'


a = Lion('bob')
print(a)  # <__main__.Lion object at 0x00000000029C6610> такой будет вид если не будет метода __repr__
a.name = 'вася'
print(a.__repr__())  # объект Lion - вася
a.name = 'петя'
print(a) # для красивого вывода срабатывает __repr__ при запуске команды print
print(a.__str__())  # просто Lion - петя. Если метода __str__  не будет, то сработает метод __repr__, но не наоборот
