"""Программа должна вывести True, если введенное значение является четным числом, в противном случае - False"""
print(not int(input()) % 2)

"""Программа должна вывести True, если введенное значение не делится на 9, в противном случае - False"""
print(not not int(input()) % 9)

"""Программа должна вывести True, если у введенного числа последняя цифра 2, в противном случае - False"""
print(input()[-1] == '2')

"""На вход программе поступают два целых числа в одной строке.
Программа должна вывести True, если оба числа делятся на 7, в противном случае - False"""
a, b = map(int, input().split())
print(a % 7 == b % 7)
# другой способ
print(all([int(i)%7 for i in input().split()]))

"""Необходимо вывести True, если данные стороны образуют правильный треугольник, в противном случае - False."""
a,b,c = map(int,input().split())
print(a==b==c)
# другой способ через множество
print(len(set(input().split())) == 1)

"""Программа должна вывести True, если хотя бы одно слово равно слову awesome"""
print(input() == "awesome" or input() == "awesome")
# другой способ через цикл и ANY
print(any(input() == 'awesome' for i in '__'))
# третий способ ОЧЕНЬ интересный !!!!!!!!!!!!!!!!!
print("awesome" in input() + input())

"""На вход поступают три целых числа - стороны треугольника.
Необходимо вывести True, если данные стороны образуют равнобедренный треугольник, в противном случае - False."""
print(len(set(input().split())) <= 2)  # правильный треугольник тоже равнобедренный, поэтому может быть один элемент

"""Программа должна вывести True, если данное число является двузначным, в противном случае - False."""
print(len(input()) == 2)

"""Необходимо вывести True, если данные стороны образуют прямоугольный треугольник, в противном случае - False."""
a, b, c = map(int, input().split())
print(a ** 2 == b ** 2 + c ** 2 or b ** 2 == c ** 2 + a ** 2 or c ** 2 == b ** 2 + a ** 2)
# другой способ по лучше  !!!!!!
a,b,c=map(int,input().split())
print(a**2+b**2+c**2-max(a,b,c)**2==max(a,b,c)**2)