"""У Олега в банке есть n евро. Он хочет снять всю сумму наличными.
Номиналы еврокупюр равны 1, 5, 10, 20, 100.
Какое минимальное число купюр должен получить Олег после того,
как снимет все деньги? На вход программе поступает одно положительные целое число n."""
summa = int(input())
quantity = 0
for banknota in [100, 20, 10, 5, 1]:
    quantity += summa // banknota
    summa -= banknota * (summa // banknota)
print(quantity)
# другой способ
summa, quantity, lst = int(input()), 0, [100, 20, 10, 5, 1]
for banknota in lst:
    quantity += summa // banknota
    summa %= banknota
print(quantity)

"""Дано число n. С начала суток прошло n минут.
Определите, сколько часов и минут будут показывать электронные часы в этот момент.
Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59).
Учтите, что число n может быть больше, чем количество минут в сутках."""
print((n := int(input())) // 60 % 24, n % 60)

"""Дано целое число n. Выведите следующее за ним четное число.
Задачу необходимо решить целочисленными операциями без использования условных операторов и\или циклов."""
print(int(input()) // 2 * 2 + 2)

"""Электронные часы показывают время в формате h:mm:ss,
то есть сначала записывается количество часов в диапазоне от 0 до 23,
потом обязательно двузначное количество минут, затем обязательно двузначное количество секунд.
Количество минут и секунд при необходимости дополняются до двузначного числа нулями.
Программа получает на вход число n - количество секунд, которое прошло с начала суток.
Выведите показания часов, соблюдая формат."""
seconds = int(input())
h = seconds // 3600 % 24
m = seconds // 60 % 60
s = seconds % 60
print(h, str(m // 10) + str(m % 10), str(s // 10) + str(s % 10),sep=':')
# другой способ по красивее
x = int(input())
print(f'{x // 3600}:{x // 60 % 60:02}:{x % 60:02}')   #!!!!!!!!!!!!!!!!!

"""
Функция trunc выполняет отсечение дробной части и оставляет только целую часть числа
Функция floor выполняет округление вниз до ближайшего целого числа
Функция ceil выполняет округление вверх до ближайшего целого числа
"""