
""" Функция eval() оценивает указанное выражение.
    Если выражение является допустимым Python-стейтментом, оно будет выполнено. """

"""Синтаксис функции eval()
    eval(выражение, globals=None, locals=None)

   выражение — строка, которая анализируется и оценивается как Python-выражение;
   globals (необязательно) — словарь;
   locals (необязательно) — объект для сопоставления. Словарь — это стандартный и часто используемый тип сопоставления в Python.
   Функция eval() возвращает результат, который получен из выражение. 
   
   Параметры globals и locals используются для глобальных и локальных переменных соответственно. 
   Если словарь locals не указан, то по умолчанию используется словарь globals. 
   Это означает, что глобальные переменные будут использоваться как для глобальных, так и для локальных переменных.
   """

""" ПРИМЕРЫ """
x = 1
print(eval('x + 1')) # -> 2

print(eval('8 11 6 5 4 3'.replace(' ', '>'))) # -> False