"""
\  - Продолжение на новой строке
\\ - Остаётся один символ \
\' - Остаётся один символ '
\" - Остаётся один символ "
\a - Звонок
\b - Забой
\f - перевод формата
\n - новая строка
\r - возврат каретки
\t - горизонтальная табуляция
\v - вертикальная табуляция
"""

'''ПРИМЕРЫ'''
print('abc-\\-bcd','Сам символ обратного слеша')
print("abc-\'-bcd", 'Апостроф')
print("abc-\a-bcd", 'Звонок')
print("abc-\b-bcd",'Забой')
print("abc-\f-bcd",'Перевод формата')
print("abc-\n-bcd",'Новая строка')
print("abc-\r-bcd",'Возврат каретки')
print("abc-\t-bcd",'Горизонтальная табуляция')
print("abc-\v-bcd",'Вертикальная Табуляция')
print('______________')
path = 'D:\nитон старое\python_obuchenie\файлы'
path1 = 'D:\nитон старое\\python_obuchenie\\файлы' # все слеши нужно экранировать вторым слешем, либо может случиться ошибка
path2 = r' D:\nитон старое\python_obuchenie\файлы' #!!!!!! первый символ  r  перед строкой, где указаны \ позволяет отключить служебные символы, чтобы небыло ошибок
print(path)
print(path1)
print(path2)


print('/\_/\\\n>^,^<\n / \ \n(|_|)_/')
print()
print("  /~~~\ \n //^ ^\\\ \n(/(_*_)\) \n_/''*''\_\n(/_)^(_\)")