"""Как использовать виртуальное окружение
Весь процесс можно разделить на следующие шаги:

-Установка модуля virtualenv
-Создание виртуального окружения при помощи virtualenv
-Активация виртуального окружения
-Установка пакетов в виртуальное окружение и их использование
-Деактивация виртуального окружения
"""

""" pip install virtualenv """ # Пакет virtualenv ставится на системный python и при помощи него создаются виртуальные окружения
""" python -m venv env """ # Данная команда запускает модуль venv (пакет virtualenv, который мы установили на
# предыдущем шаге) и создает папку с названием env(сами придумываем), в которой будет создано новое виртуальное окружение
""" env\Scripts\activate """ # Активация виртуального окружения в windows
""" pip install starlette """ # Теперь все пакеты, которые вы устанавливаете, будут ставится внутрь виртуального окружения.
""" deactivate """ # Чтобы выключить(деактивировать) виртуальное окружение, нужно выполнить команду


