# получим среднеарифметическое чисел
# внутри список приравнен к переменной, которая используется в этой строке
print(sum(map(int, a:= input().split()))/len(a))
# другой способ
from statistics import mean  # mean - функция выдаёт среднеарифметическое
print(mean(list(map(int, input().split()))))
# третий способ
print(float(__import__('statistics').mean(map(int, input().split()))))

'''Напишите программу, которая находит наилучшую оценку ученика за решение пяти контрольных работ. '''
print( max(input().split(), key=int) )

"""Известно, что на обработку одного квадратного метра панели требуется 1г сульфида. 
Всего необходимо обработать N прямоугольных панелей размером A на B метров. 
Вам необходимо подсчитать, сколько всего сульфида необходимо на обработку всех панелей. 
И не забудьте, что панели требуют обработки с обеих сторон.
На вход программе подаются 3 положительных целых числа N,A,B в одну строку"""
n,a,b = map(int, input().split())
print(a*b*2*n)
# другой способ
print ((lambda x,y,z: x*y*z*2)(*map(int,input().split()))) # первая часть функция, вторая часть список значений

"""Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
Поступает одно натуральное число S – общее количество сделанных журавликов.
В единственную строку нужно вывести три числа, разделенных пробелами – количество журавликов, 
которые сделал каждый ребенок (Петя, Катя и Сережа)."""
print(n := int(input()) // 6, n * 4, n)
# другой способ
s = int(input()) // 6
print(s, s * 4, s)

"""Однажды, посетив магазин канцелярских товаров, Вася купил X карандашей, Y ручек и Z фломастеров.
Известно, что цена ручки на 2 рубля больше цены карандаша и на 7 рублей меньше цены фломастера.
Также известно, что стоимость карандаша составляет 3 рубля. Требуется определить общую стоимость покупки."""
x, y, z = map(int, input().split())
print(3 * x + 5 * y + 12 * z)
# другой способ
print((lambda x, y, z: 3 * x + 5 * y + 12 * z)(*map(int, input().split())))

"""Бандиты Гарри и Ларри отдыхали на природе. Решив пострелять,
они выставили на бревно несколько банок из-под кока-колы (не больше 10).
Гарри начал простреливать банки по порядку, начиная с самой левой, Ларри — с самой правой.
В какой-то момент получилось так, что они одновременно прострелили одну и ту же последнюю банку.
Каждый из них помнил только, сколько банок прострелил он сам.
Определите по этим данным, сколько банок не прострелил Гарри и сколько банок не прострелил Ларри"""
g,l = map(int,input().split())
print(l-1, g-1)
# другой способ
print(*map(lambda x: int(x)-1, input().split()[::-1]))

