
''' По сути оператор switch-case можно использовать как аналог if-elif-elif-...-else.
Оператор switch появился в python совсем недавно, только начиная с версии python3.10. И здесь он называется
оператором сопоставления с шаблонами (pattern matching statement) и соответственно используется связка операторов
не switch-case, а match-case.'''

"""Оператор match-case имеет следующий синтаксис:

match value:
  case <pattern_1>:
    <action_1>
  case <pattern_2>:
    <action_2>
  case <pattern_3>:
    <action_3>
  case _:
    <action_wildcard> """

# После ключевого слова match указывается значение, которое нужно проверить на соответствие шаблону.
# В блоках case указываются сами шаблоны и проверка осуществляется сверху вниз, пока не найдется совпадение.
# Обычно в самом низу ставят блок действий по умолчанию, он выполняется в том случае,
# когда не найдется ни один из шаблонов.

n = int(input())
# match n:
#     case 1:
#         print('Совсем еще зеленый студентик')
#     case 2:
#         print('Джун-студент')
#     case 3:
#         print('Мидл-студент')
#     case 4:
#         print('Сеньор-студент')
#     case 5:
#         print('Босс качалки')
#     case _:
#         print('Неизвестный курс')

# Для того, чтобы сравнить на несколько значений в одном блоке case, необходимо перечислить значения при помощи оператора |

digit = int(input("Введите цифру: "))
# match digit:
#     case 0 | 3 | 6 | 9:
#         print("Без остатка делятся на 3")
#     case 1 | 4 | 7:
#         print("При делении на 3 дают остаток 1")
#     case 2 | 5 | 8:
#         print("При делении на 3 дают остаток 2")
#     case  _:
#         print(f"{digit} не является цифрой")

# Программа получает на вход номер месяца - натуральное число N (1 ≤ N ≤ 12) и в зависимости от его значения выводит
# количество дней в месяце. Будем считать, что год невисокосный. При решении конечно же используйте оператор match-case
n = int(input())
# match n:
#     case 1|3|5|7|8|10|12:print(31)
#     case 2:print(28)
#     case 4|6|9|11:print(30)