"""Дано натуральное число N. Определить, является ли оно простым. Натуральное число N называется простым,
если у него есть только два делителя: единица и само число N.
В качестве ответа выведите "Yes", если число простое,  "No" - в противном случае."""

n = int(input())  # 5
i = 1
box = []
while i*i <=n:
    if n%i==0:
        box.append(i)
        if i!=n//i:
            box.append(n//i)
    i+=1
print('Yes'if len(box)==2 else 'No' )   # Yes

"""Программа получает на вход натуральное число N. 
Нужно найти сумму его делителей. """
n = int(input()) # 31
i = 1
box = []
while i*i <=n:
    if n%i==0:
        box.append(i)
        if i!=n//i:
            box.append(n//i)
    i+=1
print(sum(box)) # 32