""" Алгоритм Евклида позволяет найти наибольший общий делитель (НОД) для двух чисел """

"""Даны два натуральных числа A и B. Требуется найти их наибольший общий делитель (НОД) методом вычитания"""
a,b = map(int, input().split())  # 77 22
while a != b:
    if a > b:
        a = a - b
    else:
        b = b - a
print(a)  # 11

"""Та же самая задача, необходимо найти НОД двух чисел, только теперь нужно модернизировать свой код при 
помощи нахождения остатка от деления"""
a,b = map(int, input().split()) # 200 30
while b !=0: a,b = b,a%b
print(a) # 10

"""Даны два натуральных числа A и B. Требуется найти их наименьшее общее кратное (НОК)."""
a,b = map(int, input().split())  # 14 21
a1,b1 = a,b
while b !=0: a,b = b,a%b
print(int((a1*b1)/a))  # 42





